// 建立資料庫

var restaurant = [{
        "店名": "摩斯漢堡",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "羅斯福路側",
        "地址": "台北羅斯福路三段233號"
    },
    {
        "店名": "頂呱呱",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "羅斯福路側",
        "地址": "台北市中正區羅斯福路四段134號"
    },
    {
        "店名": "麥當勞",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "羅斯福路側",
        "地址": "大安區羅斯福路二段 45 號"
    },
    {
        "店名": "祥滿速食餐坊",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段92號1樓53、56攤位"
    },
    {
        "店名": "古亭園自助餐",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "羅斯福路側",
        "地址": "台北市中正區羅斯福路二段66巷2號"
    },
    {
        "店名": "山東大史餃子館",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段24巷11號"
    },
    {
        "店名": "蕭家豬腳飯爌肉飯",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段90巷6號"
    },
    {
        "店名": "台大牛莊",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "羅斯福路側",
        "地址": "中正區羅斯福路三段286巷4弄4號"
    },
    {
        "店名": "Gugo Kitchen義國蔬食",
        "價格": "NT$250 ~ 500",
        "類別": "歐式",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段85號"
    },
    {
        "店名": "義饗食堂",
        "價格": "NT$500以上",
        "類別": "歐式",
        "地區": "羅斯福路側",
        "地址": "台北市大安區羅斯福路四段83號2樓"
    },
    {
        "店名": "J-House美式餐廳",
        "價格": "NT$250 ~ 500",
        "類別": "美式",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段78巷1弄3號"
    },
    {
        "店名": "龐德羅莎",
        "價格": "NT$500以上",
        "類別": "美式",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段85號2樓"
    },
    {
        "店名": "Burger talks",
        "價格": "NT$150 ~ 250",
        "類別": "美式",
        "地區": "羅斯福路側",
        "地址": "台北市中正區羅斯福路四段124號"
    },
    {
        "店名": "得記麻辣脆皮臭豆腐",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段52巷16弄4號"
    },
    {
        "店名": "竹之丼飯屋",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段92號"
    },
    {
        "店名": "季丼屋",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段150號"
    },
    {
        "店名": "銀咖哩",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "羅斯福路側",
        "地址": "中正區羅斯福路三段276號"
    },
    {
        "店名": "泰皇99泰國雲南料理",
        "價格": "NT$250 ~ 500",
        "類別": "泰式",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段156號"
    },
    {
        "店名": "泰味鮮 泰式主題餐廳",
        "價格": "NT$150 ~ 250",
        "類別": "泰式",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路三段316巷8弄3-4"
    },
    {
        "店名": "日船章魚小丸子",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "羅斯福路側",
        "地址": "台北羅斯福路四段90巷6號100"
    },
    {
        "店名": "藍家割包",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "羅斯福路側",
        "地址": "台北大安區羅斯福路三段316巷8弄3號"
    },
    {
        "店名": "麻糬三角紅豆餅",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路4段24巷11號106"
    },
    {
        "店名": "小g脆皮雞蛋糕",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "羅斯福路側",
        "地址": "台北市羅斯福路四段136號"
    },
    {
        "店名": "東南亞冰店",
        "價格": "NT$150以下",
        "類別": "冰品",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路四段136巷12號"
    },
    {
        "店名": "陳三鼎黑糖粉圓鮮奶專賣店",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "羅斯福路側",
        "地址": "台北羅斯福路三段316巷8弄口"
    },
    {
        "店名": "珍煮丹",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "羅斯福路側",
        "地址": "台北中正區羅斯福路一段12號100"
    },
    {
        "店名": "憶馬當鮮馬來西亞風味料理",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷61號"
    },
    {
        "店名": "馬祖麵館",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷49號1樓"
    },
    {
        "店名": "倆倆號",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "辛亥路側",
        "地址": "台北市大安區辛亥路二段221號1樓"
    },
    {
        "店名": "牛二哥小吃店",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "辛亥路側",
        "地址": "台北市大安區復興南路二段340巷32號"
    },
    {
        "店名": "三隻貓頭鷹 3owls c＠fe",
        "價格": "NT$250 ~ 500",
        "類別": "美式",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段96巷15弄38號"
    },
    {
        "店名": "惡燒肉便當專賣店",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段311巷19號"
    },
    {
        "店名": "五九麵館",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷59號"
    },
    {
        "店名": "親來食堂",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷52弄14號"
    },
    {
        "店名": "春山茶水鋪",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "辛亥路側",
        "地址": "台北市大安區復興南路二段323號"
    },
    {
        "店名": "邦食堂",
        "價格": "NT$150以下",
        "類別": "泰式",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段96巷17弄28號"
    },
    {
        "店名": "滇味小廚",
        "價格": "NT$150以下",
        "類別": "泰式",
        "地區": "辛亥路側",
        "地址": "台北市大安區復興南路二段 340 巷 5 號"
    },
    {
        "店名": "空杯國際",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷52弄1號"
    },
    {
        "店名": "泰大爺快餐店",
        "價格": "NT$150以下",
        "類別": "港式",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷50號"
    },
    {
        "店名": "磚塊廚房",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "辛亥路側",
        "地址": "台北市辛亥路2段169號"
    },
    {
        "店名": "達美樂",
        "價格": "NT$250 ~ 500",
        "類別": "速食",
        "地區": "辛亥路側",
        "地址": "台北市辛亥路一段56號"
    },
    {
        "店名": "拿坡里披薩炸雞",
        "價格": "NT$250 ~ 500",
        "類別": "速食",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段66號"
    },
    {
        "店名": "老圓環",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "辛亥路側",
        "地址": "台北市汀洲路2段131號"
    },
    {
        "店名": "全國素食",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "辛亥路側",
        "地址": "台北市大安區復興南路二段314號"
    },
    {
        "店名": "Barkers美式餐廳",
        "價格": "NT$150 ~ 250",
        "類別": "美式",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷41號"
    },
    {
        "店名": "發現義大利麵",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷35號"
    },
    {
        "店名": "微笑先生 Mr.Smile",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷36號"
    },
    {
        "店名": "笑嘻嘻港式現炒飯麵",
        "價格": "NT$150以下",
        "類別": "港式",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷59號"
    },
    {
        "店名": "瑞榮燒臘",
        "價格": "NT$150以下",
        "類別": "港式",
        "地區": "辛亥路側",
        "地址": "臺北市大安區復興南路二段346號"
    },
    {
        "店名": "Stoppage Time 補時",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段96巷15弄30號"
    },
    {
        "店名": "嗜甜點",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路二段118巷52弄16號"
    },
    {
        "店名": "何媽媽手作蒟蒻",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "辛亥路側",
        "地址": "台北市大安區臨江街30號"
    },
    {
        "店名": "一芳水果茶",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷62號"
    },
    {
        "店名": "大方冰品",
        "價格": "NT$150以下",
        "類別": "冰品",
        "地區": "辛亥路側",
        "地址": "台北市大安區和平東路三段228巷27號"
    },
    {
        "店名": "Beans Lab 豆系研究室",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "辛亥路側",
        "地址": "台北市大安區辛亥路二段171巷6弄6號"
    },
    {
        "店名": "貝倫烘焙餐坊",
        "價格": "NT$250 ~ 500",
        "類別": "甜點",
        "地區": "辛亥路側",
        "地址": "台北市和平東路二段118巷37號"
    },
    {
        "店名": "公館水煎包",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "基隆路側",
        "地址": "台北市大安區羅斯福路四段123巷1號"
    },
    {
        "店名": "阿水茶舖",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "天津蔥抓餅",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "藝素佳素食",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "日和日式手作料理",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "帝一味自助餐",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "八方雲集",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "基隆路側",
        "地址": "台科大第三餐廳"
    },
    {
        "店名": "台科大後餐鹹酥雞",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "基隆路側",
        "地址": "台北市大安區基隆路四段41巷68弄4號號"
    },
    {
        "店名": "台科大後餐炒飯炒麵",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "基隆路側",
        "地址": "台北市台北市大安區基隆路四段43號"
    },
    {
        "店名": "摩斯漢堡台科大店",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "基隆路側",
        "地址": "台科大第一餐廳"
    },
    {
        "店名": "福客鐵板料李",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "基隆路側",
        "地址": "台科大第一餐廳"
    },
    {
        "店名": "地中海私房料理",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "基隆路側",
        "地址": "台科大第一餐廳"
    },
    {
        "店名": "赤糰飯糰",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "基隆路側",
        "地址": "台科大校內（第一餐廳前）"
    },
    {
        "店名": "方蘭路真善美牛肉麵",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "基隆路側",
        "地址": "台北市大安區芳蘭路68號"
    },
    {
        "店名": "Living One",
        "價格": "NT$250 ~ 500",
        "類別": "歐式",
        "地區": "基隆路側",
        "地址": "台大明達館"
    },
    {
        "店名": "5 Senses Cafe",
        "價格": "NT$150以下",
        "類別": "美式",
        "地區": "基隆路側",
        "地址": "台北市大安區基隆路三段85號"
    },
    {
        "店名": "生活倉廚",
        "價格": "NT$250 ~ 500",
        "類別": "美式",
        "地區": "基隆路側",
        "地址": "台北市大安區基隆路三段85號"
    },
    {
        "店名": "手作豚亭日式豬排專門店",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "基隆路側",
        "地址": "台北市台北市大安區基隆路三段85號"
    },
    {
        "店名": "咕嚕薯薯",
        "價格": "NT$150 ~ 250",
        "類別": "美式",
        "地區": "基隆路側",
        "地址": "台北市台北市大安區基隆路三段85號"
    },
    {
        "店名": "紅蔥餐館台科店",
        "價格": "NT$150 ~ 250",
        "類別": "美式",
        "地區": "基隆路側",
        "地址": "台北市大安區基隆路三段137號"
    },
    {
        "店名": "50嵐台大店",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段345號"
    },
    {
        "店名": "一芳水果茶台北公館店",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段345號"
    },
    {
        "店名": "鼎太極麻辣鍋",
        "價格": "NT$250 ~ 500",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段104號"
    },
    {
        "店名": "路易莎咖啡",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段100號"
    },
    {
        "店名": "銅樂咖啡",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段96-1號"
    },
    {
        "店名": "肯德基KFC",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段96-1號"
    },
    {
        "店名": "ImPerfect Cafe",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段96-5號"
    },
    {
        "店名": "爭鮮迴轉壽司",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段88-4號"
    },
    {
        "店名": "麥當勞（新生南路）",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段88-2號"
    },
    {
        "店名": "西雅圖極品咖啡",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段88號"
    },
    {
        "店名": "靈感咖啡",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段84-6號3樓"
    },
    {
        "店名": "臺一牛奶大王",
        "價格": "NT$150以下",
        "類別": "冰品",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段82號"
    },
    {
        "店名": "滴咖啡",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段76巷1號"
    },
    {
        "店名": "光一肆號",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段76巷2號"
    },
    {
        "店名": "Pasta 2 Go",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段72號"
    },
    {
        "店名": "上好魚翅燕窩",
        "價格": "NT$500以上",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段68-1號"
    },
    {
        "店名": "鳳城燒臘粵菜",
        "價格": "NT$150以下",
        "類別": "港式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段58之3號"
    },
    {
        "店名": "溫州大餛飩",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段54-7號"
    },
    {
        "店名": "大聲公牛肉麵店",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段54之6號"
    },
    {
        "店名": "小飯廳",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷6號"
    },
    {
        "店名": "七里亭",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷8號"
    },
    {
        "店名": "俄羅斯城堡",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷14號"
    },
    {
        "店名": "集客人間茶館",
        "價格": "NT$150 ~ 250",
        "類別": "複合式",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷18號"
    },
    {
        "店名": "coco Brownies",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段283巷14弄16-1號"
    },
    {
        "店名": "八方雲集（台大店）",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷9號"
    },
    {
        "店名": "豪香熱炒",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段333巷7號"
    },
    {
        "店名": "好處 Have A Nice Day",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區羅斯福路三段283巷14弄30號"
    },
    {
        "店名": "安好食",
        "價格": "NT$150以下",
        "類別": "美式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段86巷9號"
    },
    {
        "店名": "至香園沙茶牛肉乾麵",
        "價格": "NT$150 ~ 250",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段86巷15號"
    },
    {
        "店名": "So Free 柴燒窯烤",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段86巷19號"
    },
    {
        "店名": "雪可屋",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街86號"
    },
    {
        "店名": "韓庭州韓國料理",
        "價格": "NT$150以下",
        "類別": "韓式",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街87號"
    },
    {
        "店名": "瑪莉珍比薩",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街89號"
    },
    {
        "店名": "好想吃冰",
        "價格": "NT$150以下",
        "類別": "冰品",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街80號"
    },
    {
        "店名": "Riad Chi Chi異國料理",
        "價格": "NT$250 ~ 500",
        "類別": "複合式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段76巷16號"
    },
    {
        "店名": "The French Kiss吻吧",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市台北市新生南路三段76巷5-1號1樓"
    },
    {
        "店名": "老爺De 蛋蛋屋",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段76巷10-2號"
    },
    {
        "店名": "彼克蕾友善咖啡館",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段76巷5號"
    },
    {
        "店名": "溏老鴨平價小火鍋",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段70巷3號"
    },
    {
        "店名": "公館咖哩先生",
        "價格": "NT$150 ~ 250",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段70巷6號後棟（橘色外牆）"
    },
    {
        "店名": "Roux",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北大安區新生南路三段68-2號106"
    },
    {
        "店名": "妙媽媽小廚坊",
        "價格": "NT$150 ~ 250",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市台北市大安區新生南路3段68之2號"
    },
    {
        "店名": "左巴好室好事",
        "價格": "NT$250 ~ 500",
        "類別": "複合式",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街74巷1弄2號"
    },
    {
        "店名": "柒食貳",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區溫州街72號"
    },
    {
        "店名": "會津屋日式食堂",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷12號"
    },
    {
        "店名": "霞飛驛歐法店餐",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷8號"
    },
    {
        "店名": "EMALII 伊瑪利義大利麵館",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷5號"
    },
    {
        "店名": "蘇活義大利麵",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷3號"
    },
    {
        "店名": "尚家香雲南美味麵食館",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷2之1號"
    },
    {
        "店名": "羊毛與花 溫州",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段60巷1號"
    },
    {
        "店名": "感恩小館",
        "價格": "NT$150 ~ 250",
        "類別": "歐式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段56巷6號"
    },
    {
        "店名": "麵之彩",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段56巷8號"
    },
    {
        "店名": "閒山咖啡",
        "價格": "NT$150 ~ 250",
        "類別": "咖啡廳",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段56巷11號"
    },
    {
        "店名": "女巫店",
        "價格": "NT$150 ~ 250",
        "類別": "複合式",
        "地區": "新生南路側",
        "地址": "台北市大安區新生南路三段56巷7號"
    },
    {
        "店名": "摩斯漢堡",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "COCO 都可",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "民豐號",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "比司多早午餐",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "文湯武醬",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "All Pass",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "校內",
        "地址": "小福樓2F餐飲部"
    },
    {
        "店名": "御喜自助餐",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "韓風小舖",
        "價格": "NT$150以下",
        "類別": "韓式",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "食香園素食館",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "金盃美而美",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "阿諾廚房",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "四海遊龍",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "樂法Le Phare",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "麥當勞",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "純義西點麵包坊",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "第一學生活動中心餐廳"
    },
    {
        "店名": "金閣屋",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "日式食堂",
        "價格": "NT$150以下",
        "類別": "日式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "桔客義式麵屋",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "華克山莊:傳統韓國料理",
        "價格": "NT$150以下",
        "類別": "韓式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "椰林燒臘",
        "價格": "NT$150以下",
        "類別": "港式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "吉登自助餐",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "比司多早午餐",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "悠悠鮮果屋",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "蔬食小舖",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "傅阿嬤的廚房",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "汝茶坊",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "CoCo壹番屋",
        "價格": "NT$150 ~ 250",
        "類別": "日式",
        "地區": "校內",
        "地址": "大一女宿舍餐廳"
    },
    {
        "店名": "女九宿舍餐廳自助餐",
        "價格": "NT$150以下",
        "類別": "自助",
        "地區": "校內",
        "地址": "女九宿舍餐廳"
    },
    {
        "店名": "女九宿舍餐廳滷味",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "女九宿舍餐廳"
    },
    {
        "店名": "女九宿舍餐廳五花馬",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "校內",
        "地址": "女九宿舍餐廳"
    },
    {
        "店名": "禾家飯館,麵荷",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "社科院OEC"
    },
    {
        "店名": "老農夫(鮮果,花禮,輕食)",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "校內",
        "地址": "社科院OEC"
    },
    {
        "店名": "第一小吃部",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "第二小吃部",
        "價格": "NT$150以下",
        "類別": "其他",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "第三小吃部",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "帕兔",
        "價格": "NT$150以下",
        "類別": "歐式",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "原典鮮沏茶",
        "價格": "NT$150以下",
        "類別": "飲料",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "小木屋",
        "價格": "NT$150以下",
        "類別": "甜點",
        "地區": "校內",
        "地址": "小小福"
    },
    {
        "店名": "稍飽",
        "價格": "NT$150以下",
        "類別": "中華",
        "地區": "校內",
        "地址": "醉月湖1號貨櫃屋"
    },
    {
        "店名": "SUBWAY",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "莫凡彼",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "龐德羅莎",
        "價格": "NT$250 ~ 500",
        "類別": "歐式",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "魯山人和風壽喜鍋物",
        "價格": "NT$250 ~ 500",
        "類別": "日式",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "Lacuz 泰食-樂 餐廳",
        "價格": "NT$150 ~ 250",
        "類別": "泰式",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "小蔬杭",
        "價格": "NT$250 ~ 500",
        "類別": "其他",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "歐亞穀果義式餐廳gugo kitchen",
        "價格": "NT$250 ~ 500",
        "類別": "歐式",
        "地區": "校內",
        "地址": "第二學生活動中心"
    },
    {
        "店名": "肯德基KFC",
        "價格": "NT$150以下",
        "類別": "速食",
        "地區": "校內",
        "地址": "卓越聯合大樓"
    },
    {
        "店名": "丹堤咖啡",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "校內",
        "地址": "卓越聯合大樓"
    },
    {
        "店名": "路易莎咖啡",
        "價格": "NT$150以下",
        "類別": "咖啡廳",
        "地區": "校內",
        "地址": "卓越聯合大樓"
    },
    {
        "店名": "韓天閣",
        "價格": "NT$150 ~ 250",
        "類別": "韓式",
        "地區": "羅斯福路側",
        "地址": "台北市中正區羅斯福路四段78巷1弄15號"
    },
    {
        "店名": "小飯館兒",
        "價格": "NT$150以下",
        "類別": "韓式",
        "地區": "羅斯福路側",
        "地址": "台北市中正區汀洲路三段202號"
    }
];
var str = '';
// 建立變數儲存使用者輸入的行政區
//按下搜尋後,文字會顯示出使用者所尋找的區域,並從資料庫中找尋符合條件的店家,函式-迴圈-if
document.getElementById('search_id').onclick = function findRestaurant() {
    document.getElementById('randomResult_id').innerHTML = "";
    var r_type = document.getElementById("type").value;
    var r_price = document.getElementById("price").value;
    var r_area = document.getElementById("area").value;

    var str = '';
    var temp1 = [];
    var temp2 = [];
    var temp3 = [];
    for (var i = 0; i < restaurant.length; i++) {
        if (r_type == "alltype") {
            temp1.push(i);
        } else if (r_type == "fastfood") {
            if (restaurant[i].類別 == "速食") {
                temp1.push(i);
            }
        } else if (r_type == "buffet") {
            if (restaurant[i].類別 == "自助") {
                temp1.push(i);
            }
        } else if (r_type == "zh") {
            if (restaurant[i].類別 == "中華") {
                temp1.push(i);
            }
        } else if (r_type == "eur") {
            if (restaurant[i].類別 == "歐式") {
                temp1.push(i);
            }
        } else if (r_type == "us") {
            if (restaurant[i].類別 == "美式") {
                temp1.push(i);
            }
        } else if (r_type == "hk") {
            if (restaurant[i].類別 == "港式") {
                temp1.push(i);
            }
        } else if (r_type == "jp") {
            if (restaurant[i].類別 == "日式") {
                temp1.push(i);
            }
        } else if (r_type == "tl") {
            if (restaurant[i].類別 == "泰式") {
                temp1.push(i);
            }
        } else if (r_type == "dessert") {
            if (restaurant[i].類別 == "甜點") {
                temp1.push(i);
            }
        } else if (r_type == "ice") {
            if (restaurant[i].類別 == "冰品") {
                temp1.push(i);
            }
        } else if (r_type == "drinks") {
            if (restaurant[i].類別 == "飲料") {
                temp1.push(i);
            }
        } else if (r_type == "cafe") {
            if (restaurant[i].類別 == "咖啡廳") {
                temp1.push(i);
            }
        } else if (r_type == "kr") {
            if (restaurant[i].類別 == "韓式") {
                temp1.push(i);
            }
        } else if (r_type == "other") {
            if (restaurant[i].類別 == "其他") {
                temp1.push(i);
            }
        }
    }

    for (var j = 0; j < temp1.length; j++) {
        if (r_price == "under150") {
            if (restaurant[temp1[j]].價格 == "NT$150以下") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "150_250") {
            if (restaurant[temp1[j]].價格 == "NT$150 ~ 250") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "250_500") {
            if (restaurant[temp1[j]].價格 == "NT$250 ~ 500") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "above500") {
            if (restaurant[temp1[j]].價格 == "NT$500以上") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "allprice") {
            temp2.push(temp1[j]);
        }
    }

    for (var k = 0; k < temp2.length; k++) {
        if (r_area == "incampus") {
            if (restaurant[temp2[k]].地區 == "校內") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "xinsheng") {
            if (restaurant[temp2[k]].地區 == "新生南路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "xinhai") {
            if (restaurant[temp2[k]].地區 == "辛亥路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "keelung") {
            if (restaurant[temp2[k]].地區 == "基隆路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "roosevelt") {
            if (restaurant[temp2[k]].地區 == "羅斯福路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "allarea") {
            temp3.push(temp2[k]);
        }
    }

    if (temp3.length == 0) {
        str = "抱歉，目前沒有收錄到這樣的餐廳... 要不要試試其他選項><"
    } else {
        for (var z = 0; z < temp3.length; z++) {
            var content = '</br>' + '店名：' + restaurant[temp3[z]].店名 + '</br>' + '類別：' + restaurant[temp3[z]].類別 + '</br>' + '價格：' + restaurant[temp3[z]].價格 + '</br>' + '地區：' + restaurant[temp3[z]].地區 + '</br>' + '地址：' + restaurant[temp3[z]].地址 + '</br>';
            str += content;
        }
    }




    // var output = JSON.parse(ans);
    // console.log(ans);
    // var in_district = document.getElementById('in_district_id').value;
    // var out_district = document.getElementById('out_district_id');
    // var result_id = document.getElementById('result_id');
    // var str = '';
    // out_district.textContent = in_district;
    // for (var i = 0; i < foodStand.length; i++) {
    //     if (foodStand[i].區域 == in_district) {
    //         str += '</br>' + foodStand[i].攤名;
    //     }
    // }

    result_id.innerHTML = str;
}

document.getElementById('random_id').onclick = function randomRestaurant() {
    document.getElementById('result_id').innerHTML = "";
    var r_type = document.getElementById("type").value;
    var r_price = document.getElementById("price").value;
    var r_area = document.getElementById("area").value;

    var str = '';
    var temp1 = [];
    var temp2 = [];
    var temp3 = [];
    for (var i = 0; i < restaurant.length; i++) {
        if (r_type == "alltype") {
            temp1.push(i);
        } else if (r_type == "fastfood") {
            if (restaurant[i].類別 == "速食") {
                temp1.push(i);
            }
        } else if (r_type == "buffet") {
            if (restaurant[i].類別 == "自助") {
                temp1.push(i);
            }
        } else if (r_type == "zh") {
            if (restaurant[i].類別 == "中華") {
                temp1.push(i);
            }
        } else if (r_type == "eur") {
            if (restaurant[i].類別 == "歐式") {
                temp1.push(i);
            }
        } else if (r_type == "us") {
            if (restaurant[i].類別 == "美式") {
                temp1.push(i);
            }
        } else if (r_type == "hk") {
            if (restaurant[i].類別 == "港式") {
                temp1.push(i);
            }
        } else if (r_type == "jp") {
            if (restaurant[i].類別 == "日式") {
                temp1.push(i);
            }
        } else if (r_type == "tl") {
            if (restaurant[i].類別 == "泰式") {
                temp1.push(i);
            }
        } else if (r_type == "dessert") {
            if (restaurant[i].類別 == "甜點") {
                temp1.push(i);
            }
        } else if (r_type == "ice") {
            if (restaurant[i].類別 == "冰品") {
                temp1.push(i);
            }
        } else if (r_type == "drinks") {
            if (restaurant[i].類別 == "飲料") {
                temp1.push(i);
            }
        } else if (r_type == "cafe") {
            if (restaurant[i].類別 == "咖啡廳") {
                temp1.push(i);
            }
        } else if (r_type == "kr") {
            if (restaurant[i].類別 == "韓式") {
                temp1.push(i);
            }
        } else if (r_type == "other") {
            if (restaurant[i].類別 == "其他") {
                temp1.push(i);
            }
        }
    }

    for (var j = 0; j < temp1.length; j++) {
        if (r_price == "under150") {
            if (restaurant[temp1[j]].價格 == "NT$150以下") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "150_250") {
            if (restaurant[temp1[j]].價格 == "NT$150 ~ 250") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "250_500") {
            if (restaurant[temp1[j]].價格 == "NT$250 ~ 500") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "above500") {
            if (restaurant[temp1[j]].價格 == "NT$500以上") {
                temp2.push(temp1[j]);
            }
        } else if (r_price == "allprice") {
            temp2.push(temp1[j]);
        }
    }

    for (var k = 0; k < temp2.length; k++) {
        if (r_area == "incampus") {
            if (restaurant[temp2[k]].地區 == "校內") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "xinsheng") {
            if (restaurant[temp2[k]].地區 == "新生南路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "xinhai") {
            if (restaurant[temp2[k]].地區 == "辛亥路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "keelung") {
            if (restaurant[temp2[k]].地區 == "基隆路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "roosevelt") {
            if (restaurant[temp2[k]].地區 == "羅斯福路側") {
                temp3.push(temp2[k]);
            }
        } else if (r_area == "allarea") {
            temp3.push(temp2[k]);
        }
    }

    function getRandom(x) {
        return Math.floor(Math.random() * x);
    }

    if (temp3.length == 0) {
        str = "抱歉，目前沒有收錄到這樣的餐廳... 要不要試試其他選項><"
    } else {
        var r = getRandom(temp3.length);
        str = '</br>' + '店名：' + restaurant[temp3[r]].店名 + '</br>' + '類別：' + restaurant[temp3[r]].類別 + '</br>' + '價格：' + restaurant[temp3[r]].價格 + '</br>' + '地區：' + restaurant[temp3[r]].地區 + '</br>' + '地址：' + restaurant[temp3[r]].地址 + '</br>';
    }


    randomResult_id.innerHTML = str;
}